def month_to_season():
    m = int(input("Введите номер месяца (1-12): "))
    if m in [12, 1, 2]:  # если номер месяца 12 или 1 или 2 - "зима"
        print('"Зима"')
    elif m in [3, 4, 5]:  # иначе если 3 или 4 или 5 - "весна"
        print('"Весна"')
    elif m in [6, 7, 8]:  # иначе если 6 или 7 или 8 - "лето"
        print('"Лето"')
    elif m in [9, 10, 11]:  # иначе если 9 или 10 или 11 - "осень"
        print('"Осень"')
    else:  # иначе
        print('"Такого месяца нет!"')


month_to_season()
